{
  "backend/main.mo": "Motoko backend actor that handles contact form submissions with validation, storing inquiries in a List data structure.",
  "feature_evidence.json": "Feature evidence report documenting five completed features including About section updates, product card changes (removal, addition, splitting), Why Choose Us section updates, and asset rendering.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend component files describing their purpose and content, including sections for Hero, About, Products, Contact, Address, and Footer.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system variables for light and dark themes, defining design tokens for the application.",
  "frontend/index.html": "HTML entry point with EVRON branding in title and meta description, loading the React app from main.tsx.",
  "frontend/src/App.tsx": "Main React app component that renders all page sections in order: Hero, About, Products, Why Choose Us, Contact, Address, and Footer.",
  "frontend/src/components/AboutSection.tsx": "About section component describing EVRON as an innovative energy company with three feature cards (High Performance, Maximum Safety, Built to Last) and detailed company description.",
  "frontend/src/components/AddressSection.tsx": "Address section component displaying Head Office (Bokaro) and Branch Office (Daltonganj) locations in card format with MapPin icons and brand-green styling.",
  "frontend/src/components/ContactSection.tsx": "Contact section with form (name, email, message) that submits to backend actor, plus contact information cards showing phone (+91 9296174465) and email with toast notifications.",
  "frontend/src/components/Footer.tsx": "Footer component with EVRON logo, tagline, contact info (+91 phone and email), quick links, social media icons (Facebook, X, LinkedIn, Instagram), and caffeine.ai attribution.",
  "frontend/src/components/HeroSection.tsx": "Hero section component displaying EVRON logo, tagline, main heading, phone number with call-to-action, and a background image with gradient overlay. Includes smooth scroll functionality to contact section.",
  "frontend/src/components/ProductsSection.tsx": "Products section component showcasing five EVRON battery products (EV, solar, telecom batteries and 2KW/3KW inverters) in a responsive grid layout with images, icons, and descriptions.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Benefits section component displaying six key advantages of EVRON products (long life, fast charging, safety, efficiency, reliability, BMS technology) in a grid with icons and hover effects.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance based on Internet Identity authentication state, automatically invalidating and refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity authentication hook and provider for ICP, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Custom hook providing a mutation for submitting contact form data to the backend actor, with automatic query invalidation on success.",
  "frontend/src/index.css": "Global CSS file defining Tailwind layers, CSS custom properties for light/dark themes, EVRON brand colors (green theme), and utility classes for brand-specific styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (including EVRON brand green), typography, animations, and container settings using OKLCH color space.",
  "project_state.json": "Project state file tracking version 9 of EVRON energy company website with hero section, 5 products (EV/Solar/Telecom batteries, 2KW/3KW inverters), benefits section, contact form, and two office addresses. Defines brand identity with green leaf logo, black/green/white color scheme, and tagline 'Drive the Future, Live the Green'."
}