{
  "backend/main.mo": "Main actor with Inquiry type (name, phone, email, message), validates all fields are non-empty and phone is exactly 10 digits, stores inquiries in a List, and applies migration on deployment.",
  "backend/migration.mo": "Migration module that transforms old inquiries (without phone field) to new inquiries (with phone field) by adding an empty string default for phone during upgrade.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including EVRON logo redesign, hero section updates with tagline and contact info, energetic background, and product image regeneration with realistic branding.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components for hero, about, products, contact, footer, terms, privacy pages with EVRON branding, GST details, and four-field contact form.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with EVRON title, meta description for advanced lithium batteries and energy solutions, and script tag loading main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup with root route and three child routes: home page (index), terms page, and privacy page, rendering HomePage component with all sections for the index route.",
  "frontend/src/components/AboutSection.tsx": "About section displaying EVRON India Private Limited description with LiFePO4 battery details, BMS protection, 3000-5000 cycle performance, GSTIN (20AAJCE1166D1Z8), GST badge image, and two office addresses in card layout.",
  "frontend/src/components/AddressSection.tsx": "Locations section displaying Head Office (Bokaro Steel City) and Branch Office (Daltonganj, Palamu) addresses in black cards with green accents and MapPin icons.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with name, phone, email, and message fields that submits data to the backend actor and displays toast notifications. Includes contact information display with phone, email, and address details.",
  "frontend/src/components/Footer.tsx": "Footer component displaying EVRON logo, tagline, quick navigation links, contact information, and social media icons. Handles smooth scrolling to page sections and navigation to legal pages.",
  "frontend/src/components/HeroSection.tsx": "Hero section with full-screen background image, EVRON logo, headline, tagline, prominent phone number display, and CTA buttons for exploring products and contacting. Includes smooth scroll navigation to other sections.",
  "frontend/src/components/PrivacyPage.tsx": "Privacy policy page displaying information collection practices, data usage, security measures, and user rights in card-based layout. Includes header with logo and back-to-home navigation button.",
  "frontend/src/components/ProductsSection.tsx": "Products showcase section displaying five battery and inverter products (EV, Solar, Telecom batteries, 2KW and 3KW inverters) with images, features, specifications, and warranty information in card grid layout.",
  "frontend/src/components/TermsPage.tsx": "Terms and conditions page outlining general terms, warranty policy, and usage guidelines in card-based layout. Includes header with logo and back-to-home navigation button.",
  "frontend/src/components/WhyChooseUsSection.tsx": "React component displaying a grid of 7 benefit cards (Long Life Lithium, 3000-5000 Cycles, Smart BMS, 8Y Warranty, High Safety, Energy Efficient, After-Sales Support) with icons, titles, descriptions, and hover animations using EVRON brand green.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an ICP backend actor using React Query, switching between authenticated and anonymous actors based on Internet Identity login state, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication on ICP, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query mutation hook for submitting contact form data (name, phone, email, message) to the backend actor and invalidating the contact-forms query cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with EVRON brand colors (green #2ecc71, black), custom CSS variables for light/dark themes using OKLCH color space, and utility classes for brand-specific styling.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component wrapped with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with EVRON brand colors (brand-green, brand-green-dark, brand-black), custom spacing, Inter font family, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata documenting EVRON India Private Limited's website structure, including company details (GST, addresses), product specifications (5 products with warranty details), design system (black/green/white), and architectural notes about layout order and branding requirements."
}