{
  "kind": "build_request",
  "title": "Rebuild EVRON website with new logo, remove Industrial Battery, add Telecom Battery and split Inverter products",
  "projectName": "EVRON Energy",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Design and generate a new EVRON logo featuring two symmetrical green leaves (#2ecc71) that form a subtle 'V' shape representing growth and energy, using a bold modern sans-serif font, with a minimal eco-friendly corporate aesthetic",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Design a clean and powerful logo for EVRON using two symmetrical green leaves. The two leaves should form a subtle \"V\" shape representing growth and energy. Use a bold modern sans-serif font. Primary green color: #2ecc71"
        ]
      },
      "acceptanceCriteria": [
        "Logo displays two symmetrical green leaves in #2ecc71 color",
        "Leaves form a subtle V shape",
        "Uses bold modern sans-serif font for EVRON text",
        "Design appears minimal, eco-friendly and corporate"
      ]
    },
    {
      "id": "REQ-26",
      "text": "Display the tagline 'Drive the Future, Live the Green' clearly visible below the EVRON logo in the hero section",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Tagline clearly visible: Drive the Future, Live the Green"
        ]
      },
      "acceptanceCriteria": [
        "Tagline 'Drive the Future, Live the Green' appears below logo in hero section",
        "Tagline is clearly readable and prominently displayed"
      ]
    },
    {
      "id": "REQ-27",
      "text": "Update About section content to describe EVRON as an innovative energy company delivering reliable lithium battery and inverter solutions for homes, telecom infrastructure, EVs and solar systems with strong professional tone",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Write a strong professional paragraph describing EVRON as an innovative energy company delivering reliable lithium battery and inverter solutions for homes, telecom infrastructure, EVs and solar systems."
        ]
      },
      "acceptanceCriteria": [
        "About section contains professional paragraph mentioning homes, telecom infrastructure, EVs and solar systems",
        "Text conveys EVRON as innovative energy company",
        "Content focuses on lithium battery and inverter solutions"
      ]
    },
    {
      "id": "REQ-28",
      "text": "Remove Industrial Battery Pack product card completely from the Products section",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Remove Industrial Battery completely."
        ]
      },
      "acceptanceCriteria": [
        "Industrial Battery Pack product card is no longer displayed",
        "Products section does not reference industrial batteries"
      ]
    },
    {
      "id": "REQ-29",
      "text": "Add Telecom Battery product card to the Products section with professional description and premium styling",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Telecom Batteries",
          "- Telecom Battery"
        ]
      },
      "acceptanceCriteria": [
        "Telecom Battery appears as a product card in Products section",
        "Card displays product name, description and follows existing card styling",
        "Card includes product image with EVRON branding"
      ]
    },
    {
      "id": "REQ-30",
      "text": "Split the existing Lithium Inverter product into two separate product cards: 'Lithium Inverter 2KW (2000W)' and 'Lithium Inverter 3KW (3000W)'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "- Lithium Inverter 2KW (2000W)\n- Lithium Inverter 3KW (3000W)"
        ]
      },
      "acceptanceCriteria": [
        "Lithium Inverter 2KW (2000W) displays as separate product card",
        "Lithium Inverter 3KW (3000W) displays as separate product card",
        "Both cards include power ratings in title",
        "Each card has distinct product image with EVRON branding"
      ]
    },
    {
      "id": "REQ-31",
      "text": "Update Why Choose EVRON section to display six benefits: 'Long Life Cycle', 'Fast Charging Technology', 'High Safety Standards', 'Energy Efficient Systems', 'Reliable Power Backup', and 'Advanced BMS Technology'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "- Long Life Cycle\n- Fast Charging Technology\n- High Safety Standards\n- Energy Efficient Systems\n- Reliable Power Backup\n- Advanced BMS Technology"
        ]
      },
      "acceptanceCriteria": [
        "All six benefits are displayed in Why Choose EVRON section",
        "Advanced BMS Technology is included as the sixth benefit",
        "Each benefit displays with appropriate icon and description"
      ]
    },
    {
      "id": "REQ-32",
      "text": "Apply premium modern corporate design with clean spacing, energy-themed background, strong green (#2ecc71) highlights, and professional layout throughout the website",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Modern corporate layout. Premium clean spacing. Energy-themed background. Strong green highlights."
        ]
      },
      "acceptanceCriteria": [
        "Website displays modern corporate aesthetic",
        "Spacing between sections is clean and premium",
        "Background uses energy theme",
        "Green color #2ecc71 is prominently used for highlights and accents",
        "Layout appears professional and polished"
      ]
    },
    {
      "id": "REQ-33",
      "text": "Render all generated product images and brand assets (logo, product images for EV Battery, Solar Battery, Telecom Battery, Inverter 2KW, Inverter 3KW) as static files in frontend/public/assets/generated directory",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ]
      },
      "acceptanceCriteria": [
        "All generated images are saved in frontend/public/assets/generated",
        "Images are referenced as static assets in frontend components",
        "Images do not route through backend"
      ]
    }
  ],
  "constraints": [
    "Do not change the backend contact form schema",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts",
    "Do not edit frontend/src/hooks/useActor.ts",
    "Do not edit frontend/src/main.tsx",
    "Do not edit files in frontend/src/components/ui"
  ],
  "nonGoals": [
    "Adding new backend functionality beyond contact form",
    "Implementing user authentication",
    "Creating admin panel",
    "Adding e-commerce features",
    "Integrating payment systems",
    "Adding real-time features or chat"
  ],
  "imageRequirements": {
    "required": [
      "EVRON logo with two symmetrical green leaves forming subtle V shape, bold modern sans-serif font, green color #2ecc71, minimal eco-friendly corporate design (evron-logo.dim_400x200.png)",
      "EV Lithium Battery product with EVRON branding: two-leaf green logo above EVRON text in bright green, tagline 'Drive the Future, Live the Green' below, matte black or white body, realistic professional printing (ev-battery.dim_800x600.png)",
      "Solar Storage Battery product with EVRON branding: two-leaf green logo above EVRON text in bright green, tagline 'Drive the Future, Live the Green' below, matte black or white body, realistic professional printing (solar-battery.dim_800x600.png)",
      "Telecom Battery product with EVRON branding: two-leaf green logo above EVRON text in bright green, tagline 'Drive the Future, Live the Green' below, matte black or white body, realistic professional printing (telecom-battery.dim_800x600.png)",
      "Lithium Inverter 2KW (2000W) product with EVRON branding: two-leaf green logo above EVRON text in bright green, tagline 'Drive the Future, Live the Green' below, matte black or white body, realistic professional printing (inverter-2kw.dim_800x600.png)",
      "Lithium Inverter 3KW (3000W) product with EVRON branding: two-leaf green logo above EVRON text in bright green, tagline 'Drive the Future, Live the Green' below, matte black or white body, realistic professional printing (inverter-3kw.dim_800x600.png)",
      "Energy-themed hero background with modern corporate aesthetic, green accents, suitable for EVRON brand (hero-background.dim_1920x1080.png)"
    ],
    "edits": []
  }
}