{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rebuild EVRON website with new logo, remove Industrial Battery, add Telecom Battery and split Inverter products",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Design and generate a new EVRON logo featuring two symmetrical green leaves forming a subtle V shape with bold modern sans-serif font",
      "acceptanceCriteria": [
        "Logo displays two symmetrical green leaves in #2ecc71 color",
        "Leaves form a subtle V shape",
        "Uses bold modern sans-serif font for EVRON text",
        "Design appears minimal, eco-friendly and corporate"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Update logo import to reference the generated EVRON logo at frontend/public/assets/generated/evron-logo.dim_400x200.png instead of the current logo path. Ensure the logo displays prominently in the hero section with appropriate sizing and alt text describing the two-leaf V-shaped design."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update footer logo to reference the generated EVRON logo at frontend/public/assets/generated/evron-logo.dim_400x200.png. Ensure consistent branding across the website footer."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Display the tagline 'Drive the Future, Live the Green' clearly visible below the EVRON logo in the hero section",
      "acceptanceCriteria": [
        "Tagline 'Drive the Future, Live the Green' appears below logo in hero section",
        "Tagline is clearly readable and prominently displayed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Ensure the tagline 'Drive the Future, Live the Green' is displayed clearly and prominently below the EVRON logo. Update styling to make it more visible using brand-green color (#2ecc71) accents and appropriate typography for readability."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Update About section content to describe EVRON as an innovative energy company delivering reliable lithium battery and inverter solutions",
      "acceptanceCriteria": [
        "About section contains professional paragraph mentioning homes, telecom infrastructure, EVs and solar systems",
        "Text conveys EVRON as innovative energy company",
        "Content focuses on lithium battery and inverter solutions"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AboutSection.tsx",
          "operation": "modify",
          "description": "Replace the current about text with a strong professional paragraph describing EVRON as an innovative energy company delivering reliable lithium battery and inverter solutions for homes, telecom infrastructure, EVs, and solar systems. Maintain the existing card layout with Battery, Shield, and Zap icons while updating the main descriptive content to reflect the new messaging."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Remove Industrial Battery Pack product card completely from the Products section",
      "acceptanceCriteria": [
        "Industrial Battery Pack product card is no longer displayed",
        "Products section does not reference industrial batteries"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductsSection.tsx",
          "operation": "modify",
          "description": "Remove the Industrial Battery Pack product card entirely from the products grid. Ensure the remaining product cards (EV Battery, Solar Battery, and any newly added products) maintain proper responsive grid layout without the industrial battery entry."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Add Telecom Battery product card to the Products section with professional description and premium styling",
      "acceptanceCriteria": [
        "Telecom Battery appears as a product card in Products section",
        "Card displays product name, description and follows existing card styling",
        "Card includes product image with EVRON branding"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductsSection.tsx",
          "operation": "modify",
          "description": "Add a new Telecom Battery product card to the products grid using the generated image at frontend/public/assets/generated/telecom-battery.dim_800x600.png. Include a professional description highlighting reliability for telecom infrastructure. Follow the existing card styling pattern with icon, title, image, and description. Position it appropriately within the product grid after EV and Solar batteries."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Split the existing Lithium Inverter product into two separate product cards: Lithium Inverter 2KW (2000W) and Lithium Inverter 3KW (3000W)",
      "acceptanceCriteria": [
        "Lithium Inverter 2KW (2000W) displays as separate product card",
        "Lithium Inverter 3KW (3000W) displays as separate product card",
        "Both cards include power ratings in title",
        "Each card has distinct product image with EVRON branding"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductsSection.tsx",
          "operation": "modify",
          "description": "Replace the single Lithium Inverter product card with two separate cards: 'Lithium Inverter 2KW (2000W)' using the generated image at frontend/public/assets/generated/inverter-2kw.dim_800x600.png and 'Lithium Inverter 3KW (3000W)' using frontend/public/assets/generated/inverter-3kw.dim_800x600.png. Each card should display the power rating prominently in the title and include appropriate descriptions highlighting their respective power capacities. Maintain consistent styling with other product cards."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Update Why Choose EVRON section to display six benefits including Advanced BMS Technology",
      "acceptanceCriteria": [
        "All six benefits are displayed in Why Choose EVRON section",
        "Advanced BMS Technology is included as the sixth benefit",
        "Each benefit displays with appropriate icon and description"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WhyChooseUsSection.tsx",
          "operation": "modify",
          "description": "Update the benefits section to display all six benefits: Long Life Cycle, Fast Charging Technology, High Safety Standards, Energy Efficient Systems, Reliable Power Backup, and Advanced BMS Technology. Add the sixth benefit card for Advanced BMS Technology with an appropriate icon (Cpu or CircuitBoard) and description. Ensure the grid layout accommodates six items with proper responsive behavior and maintains consistent styling with hover effects."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Apply premium modern corporate design with clean spacing, energy-themed background, and strong green highlights throughout the website",
      "acceptanceCriteria": [
        "Website displays modern corporate aesthetic",
        "Spacing between sections is clean and premium",
        "Background uses energy theme",
        "Green color #2ecc71 is prominently used for highlights and accents",
        "Layout appears professional and polished"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global styles to enhance premium spacing, refine the brand-green color implementation for #2ecc71 accents, and ensure consistent modern corporate aesthetic. Add or refine utility classes for section spacing, typography hierarchy, and green highlight treatments that support the professional layout."
        },
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Update hero background to use the generated energy-themed background image at frontend/public/assets/generated/hero-background.dim_1920x1080.png. Apply gradient overlay to ensure text readability while showcasing the energy-themed aesthetic. Enhance spacing and layout for a premium corporate feel with strong green (#2ecc71) accents on call-to-action elements."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review and adjust section spacing throughout the main app component to ensure premium clean spacing between all sections (Hero, About, Products, WhyChooseUs, Contact, Address, Footer). Apply consistent padding and margin utilities for a polished professional layout."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Render all generated product images and brand assets as static files in frontend/public/assets/generated directory",
      "acceptanceCriteria": [
        "All generated images are saved in frontend/public/assets/generated",
        "Images are referenced as static assets in frontend components",
        "Images do not route through backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductsSection.tsx",
          "operation": "modify",
          "description": "Ensure all product images reference static assets from frontend/public/assets/generated: ev-battery.dim_800x600.png for EV Battery, solar-battery.dim_800x600.png for Solar Battery, telecom-battery.dim_800x600.png for Telecom Battery, inverter-2kw.dim_800x600.png for Inverter 2KW, and inverter-3kw.dim_800x600.png for Inverter 3KW. Use standard img src attributes pointing to /assets/generated/[filename] paths to load images as static frontend assets without backend involvement."
        },
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Ensure the logo image at frontend/public/assets/generated/evron-logo.dim_400x200.png and hero background at frontend/public/assets/generated/hero-background.dim_1920x1080.png are referenced as static assets using standard img src or CSS background-image properties pointing to /assets/generated/[filename] paths."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Ensure the footer logo references the static asset at frontend/public/assets/generated/evron-logo.dim_400x200.png using standard img src attribute pointing to /assets/generated/evron-logo.dim_400x200.png."
        }
      ]
    }
  ]
}